Q1

In [2]:
import pandas as pd

In [4]:
data=[4,8,15,16,23,42]
ser=pd.Series(data)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2

In [6]:
var=[1,2,3,4,5,6,7,8,9,10]
ser=pd.Series(var)
print(ser)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3

In [7]:
data={'Name':['Alice','Bob','Claine'],'Age':[25,30,37],'Gender':['Female','Male','Female']}
df=pd.DataFrame(data)

In [9]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claine   37  Female

Q4

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.Heterogenous – DataFrame elements can have different data types.Size-mutable – Elements can be dropped or added in an existing DataFrame.

A Pandas series is a 1 dimensional data structure.Homogenous – Series elements must be of the same data type.Size-immutable – Once created, the size of a Series object cannot be changed.

Q5

 Remove Column from pandas DataFrame

In [14]:
data_drop = df.drop('Age',axis=1)
print(data_drop)

     Name  Gender
0   Alice  Female
1     Bob    Male
2  Claine  Female

Q5

 Add New Column to pandas DataFrame

In [17]:
age=[25,30,37]
data_add = data_drop.assign(age=age)
data_add

     Name  Gender  age
0   Alice  Female   25
1     Bob    Male   30
2  Claine  Female   37

We can read the dataframe by using head() function also which is having an argument (n) i.e. number of rows to be displayed.

In [18]:
df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

Counting the rows and columns in DataFrame using shape(). It returns the no. of rows and columns enclosed in a tuple.

In [19]:
df.shape

(3, 3)

Summary of Statistics of DataFrame using describe() method.

In [20]:
df.describe()

             Age
count   3.000000
mean   30.666667
std     6.027714
min    25.000000
25%    27.500000
50%    30.000000
75%    33.500000
max    37.000000

Q6

Dataframe is mutable in nature.data can be added, updated or deleted. However, when additional information to a DataFrame is carried by adding a Pandas Series to the DataFrame, the Pandas Series length cannot be changed. That is when the DataFrame is immutable.

Q7

In [21]:
series1=pd.Series([6,6,4,5,7,9,1,4])
series2=pd.Series([6,6,4,5,7,9,1,4])
df=pd.concat([series1,series2],axis=1)

In [22]:
df

   0  1
0  6  6
1  6  6
2  4  4
3  5  5
4  7  7
5  9  9
6  1  1
7  4  4